package pattern;

public interface Pattern {

	/**
	 * 模式描述为：在一定环境中解决某一问题的方案，包括三个基本元素--问题，解决方案和环境。
	 *  
	 * 阅读类图和对象图请先学习UML 
	 * 
	 * 创建模式 结构模式 行为模式 
	 * 修改一下东西
	 * 创建模式：对类的实例化过程的抽象。一些系统在创建对象时，需要动态地决定怎样创建对象，创建哪些对象，以及如何组合和表示这些对象。
	 * 		       创建模式描述了怎样构造和封装这些动态的决定。包含类的创建模式和对象的创建模式。
	 * 
	 * 结构模式：描述如何将类或对象结合在一起形成更大的结构。分为类的结构模式和对象的结构模式。
	 * 		       类的结构模式使用继承把类，接口等组合在一起，以形成更大的结构。类的结构模式是静态的。
	 * 		       对象的结构模式描述怎样把各种不同类型的对象组合在一起，以实现新的功能的方法。对象的结构模式是动态的。
	 * 
	 * 
	 * 行为模式：对在不同的对象之间划分责任和算法的抽象化。不仅仅是关于类和对象的，并是关于他们之间的相互作用。
	 * 		      类的行为模式使用继承关系在几个类之间分配行为。对象的行为模式则使用对象的聚合来分配行为。
	 */
}
